[
    {
        "heading": "Croatian Coasts",
        "technologies": "HTML, PHP, CSS",
        "description": "A PHP themeing project based on designs from a high-end resort chain from Croatia.",
        "thumbnail": "images/project-image3.jpg",
        "url": "https://peprojects.dev/alpha-3/josh/projects/layout-theme-challenge/",
        "slug": "123",
        "case-study":
        {
            "sections":
            [
                {
                    "module": "project-links",
                    "github": "https://github.com/JoshBenjaminG/Theme-Challenge",
                    "site_link": "https://peprojects.dev/alpha-3/josh/projects/layout-theme-challenge/"
                },
                {
                    "module": "text",
                    "heading": "Croatian Coasts",
                    "content": "<p class='calm-voice'>The goal for this project was to research and emulate designs from a set of industries. I decided to research the luxury hotel industry because of the high quality of images about travel and hospitality.</p>"
                },
                {
                    "module": "image",
                    "img": "images/research-picture.jpg",
                    "caption": "<p class='caption'>I like to let the content guide the design - if I can find high-end images, then I’ll go for a luxury level of design.</p>",
                    "description": "<p class='description'>Based on my research, I noticed that I should use colorful images, but stick to more neutral colors. With web designs in the luxury hotel niche, the content should do most of the heavy lifting. Images of the hotel or the activities that guests can expect should be front and center.</p>"
                },
                {
                    "module": "text",
                    "heading": "The Style Tile Phase",
                    "content": "<p> Practically, style tiles are able to quickly communicate high-level ideas about the direction of the design process to achieve feedback ASAP. The feedback process from designer, developer, and client is one of the most important steps in the development process and if used correctly, style tiles \ncan increase final product quality in a timely manner at an efficient cost. </p>"
                },
                {
                    "module": "image",
                    "img": "images/style-tilecasestudy1.jpg",
                    "caption": "<p>“Style Tiles are a design deliverable consisting of fonts, colors and interface elements that communicate the essence of a visual brand for the web.” - Style-tile.come</p>",
                    "description": "<p>I stuck to content that was similar to what I found in my research, and decided to go for white backgrounds to accentuate the hotel images. During feedback, I decided to also include more images as transparent backgrounds to display text, to give the page a more dynamic and premium feel.</p>"
                },
                {
                    "module": "image",
                    "heading": "A CSS and PHP design framework",
                    "img": "images/responsive-module1.jpg",
                    "caption": "",
                    "description": "<p class='calm-voice'>This is the basic skeletal structure of the site, and while I’ll go on to change it, this design provides a solid foundation for the style tile elements to be added.</p> <p class='calm-voice'>This process would serve as a jumping off point to add and change the structure of the site moving forward.</p>"
                },
                {
                    "module": "image",
                    "heading": "The Finished Product",
                    "img": "",
                    "description": "<p class='calm-voice'>After several iterations and rounds of feedback, I learned that what makes a design feel pro is the last few percent - the small details make the biggest difference.</p>"
                }
            ]
        }
    },
    {
        "heading": "Riche Fashion",
        "technologies": "HTML, PHP, CSS",
        "description": "A research project that implemented design principles found among fashion websites.",
        "thumbnail": "images/project-image2.jpg",
        "url": "https://peprojects.dev/alpha-3/josh/projects/riche-fashion/",
        "slug": "345",
        "case-study":
        {
            "sections":
            [
                {
                    "module": "project-links",
                    "github": "https://github.com/JoshBenjaminG/pe-projects/tree/master/projects/riche-fashion",
                    "site_link": "https://peprojects.dev/alpha-3/josh/projects/riche-fashion/"
                },
                {
                    "module": "text",
                    "heading": "Project Goals",
                    "content": "<p class='calm-voice'>In this project, I wanted to produce a design that was based on my research of high-end fashion websites. I began by researching various sites like Prada and Gucci to see what visual language they used.</p>"
                },
                {
                    "module": "image",
                    "heading": "The Research Phase",
                    "img": "images/trimmed-images/research1.jpg",
                    "caption": "This is an example of that research",
                    "description": "<p class='calm-voice'>From my research, I noticed that the sites I was finding tended to use large images of models to highlight the clothing they were wearing. I knew that image content choice for this site would be one of the most important steps - which is true for almost all sites, but especially true within the context of a fashion company. I took away that I should use minimal text and to communicate through images of the models when possible.</p>"
                },
                {
                    "module": "image",
                    "heading": "Unslpash is king!",
                    "img": "images/trimmed-images/riche-fashion-research.jpg",
                    "caption": "This is an example of that research",
                    "description": "<p class='calm-voice'>Unsplash.come is a great resource for finding image content, and I decided to stick with images similar to what I was finding on sites like Prada and Gucci. I wanted bold colors and fashionable design choices to be the main focus of the site. I knew from the beginning that I wanted to stick with white background and black text for the pages, so finding images that had high color contrast was really important, as I didn't want to take away from the content by making the text or background of the page to be the focal point - in this project at least.</p>"
                },
                {
                    "module": "image",
                    "heading": "The Style Tile Phase",
                    "img": "images/trimmed-images/tile1.jpg",
                    "caption": "This is an example of that research",
                    "description": "<p class='calm-voice'>Just like with this portfolio and the hotel projects, style tiles act as an important step in the design and development process. Tiles are a loosely created board of samples of what the design could look like. Tiles are a cheap and efficient way of presenting options to the client without having to go down the more costly route of jumping right to code mockups.</p> <p class='calm-voice'> User feedback is really important to strengthen the relationship between the client and the design and development team and create the best final product cheaply and quickly. I decided to present some elements such as buttons, item lists and cards, and landing elements to my mentors.</p>"
                },
                {
                    "module": "image",
                    "heading": "The First Draft",
                    "img": "images/trimmed-images/layout1.jpg",
                    "caption": "This is an example of that research",
                    "description": "<p class='calm-voice'>With the userfeedback from the style tile phase in hand, I created the first version of the layout. I was pleased with the direction of the project, and was keeping many of the design choices I learned from other websites in mind.</p> <p class='calm-voice'>This still left another step to go: I had to create other pages, including the item lists and detail lists. I knew going in that I would have to learn quite a bit about databases and JSON - and accessing those items to show on the page. I was trying to make an ecommerce site without unique items and filters. It wouldn't be a cake walk.</p>"
                }
            ]
        }
    },
    {
        "heading": "Coding Exercises",
        "technologies": "HTML, PHP, CSS",
        "description": "Solutions to a book full of challenges designed to develop your programming skills.",
        "thumbnail": "images/project-image1.jpg",
        "url": "https://peprojects.dev/alpha-3/josh/projects/e4p/",
        "slug": "678",
        "case-study":
        {
            "sections":
            [
                {
                    "module": "project-links",
                    "github": "https://github.com/JoshBenjaminG/pe-projects/tree/master/projects/e4p",
                    "site_link": "https://peprojects.dev/alpha-3/josh/projects/e4p/"
                },
                {
                    "module": "text",
                    "heading": "Project Goals",
                    "content": "<p class='calm-voice'>In this project, I wanted to improve my programming skills by following challenges in the book: 'Exercises for Programmers 4.'</p>"
                },
                {
                    "module": "text",
                    "heading": "Next steps",
                    "content": "<p class='calm-voice'>This was a great project to learn with, and I am also going to read a book on algorithms called 'Grokking Algorithms' when I'm done completing these challenges.</p>"
                }
            ]
        }
    },
   {
        "heading": "Figma Conversion",
        "technologies": "HTML, PHP, CSS",
        "description": "A complete mockup of a design that started in a figma file.",
        "thumbnail": "images/projectimage9.png",
        "url": "https://peprojects.dev/alpha-3/josh/projects/figma/figma-conversion/",
        "slug": "777",
        "case-study":
        {
            "sections":
            [
                {
                    "module": "project-links",
                    "github": "https://github.com/JoshBenjaminG/pe-projects/tree/master/projects/e4p",
                    "site_link": "https://peprojects.dev/alpha-3/josh/projects/e4p/"
                },
                {
                    "module": "text",
                    "heading": "Project Goals",
                    "content": "<p class='calm-voice'>In this project, I wanted to improve my programming skills by following challenges in the book: 'Exercises for Programmers 4.'</p>"
                },
                {
                    "module": "text",
                    "heading": "Next steps",
                    "content": "<p class='calm-voice'>This was a great project to learn with, and I am also going to read a book on algorithms called 'Grokking Algorithms' when I'm done completing these challenges.</p>"
                }
            ]
        }
    }
]